## Recap: 
- imported pandas
- created a DataFrame
- Counted the no. of rows and columns in our DataFrame
- Displayed the frist 3 rows of our DataFrame

## Task: 
- We are given a DataFrame 
- We want to filter it by student_data = 101
- We want to return the columns: name and age

In [11]:
student_data = [
    [101, 'Ulysses', 13],
    [53, 'William', 10],
    [128, 'Henry', 6],
    [3, 'Henry', 11], 
]

In [9]:
student_data_columns = ['student_id', 'name', 'age']

In [15]:
import pandas as pd

In [17]:
df = pd.DataFrame(data=student_data, columns=student_data_columns)

In [19]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

To select a specific column from our 'df', we can do: df['name_of_column']

In [31]:
df['student_id']

0    3
1    3
2    3
3    3
Name: student_id, dtype: int64

In [35]:
df['student_id'] == 101

0    True
1    True
2    True
3    True
Name: student_id, dtype: bool

In [37]:
df['student_id'] == 3

0    False
1    False
2    False
3    False
Name: student_id, dtype: bool

In [39]:
df.loc[df['student_id'] ==101, ['name', 'age']]

      name  age
0  Ulysses   13
1  William   10
2    Henry    6
3    Henry   11

## New Task: 

- Create a new column in 'student_data' called 'age_in_dog_years'
- For the values of 'age_in_dog_years', multiply 'age' *7.5

In [42]:
df

   student_id     name  age
0         101  Ulysses   13
1         101  William   10
2         101    Henry    6
3         101    Henry   11

In [44]:
df['age']

0    13
1    10
2     6
3    11
Name: age, dtype: int64

In [47]:
# Create a new column: 

df['age_in_dog_years'] = df['age'] * 7.5

In [49]:
df

   student_id     name  age  age_in_dog_years
0         101  Ulysses   13              97.5
1         101  William   10              75.0
2         101    Henry    6              45.0
3         101    Henry   11              82.5

## Checkpoint: 

1. Once we have our 'df' (or table), we want to focus in on a specific column. For example, student_id
2. We want to

In [52]:
df

   student_id     name  age  age_in_dog_years
0         101  Ulysses   13              97.5
1         101  William   10              75.0
2         101    Henry    6              45.0
3         101    Henry   11              82.5

In [54]:
df['student_id']

0    101
1    101
2    101
3    101
Name: student_id, dtype: int64